MarianDubei/EEGfirmware/EEG_Project_Demo.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ble_gatt.h"
#include "ble.h"
#include "ble_HAL_PVT.h"
#include "ble_STACK_PVT.h"
#include "ble_StackGap.h"
#include "ble_StackGatt.h"
#include "ble_StackGattDb.h"
#include "ble_StackHostMain.h"
#include "ble_StackL2cap.h"
#include "ble_StackGattServer.h"
#include "ble_StackGattClient.h"
#include "ble_Stack.h"
#include "ble_eventHandler.h"
#include "ble_custom.h"
#include "red.h"
#include "red_aliases.h"
#include "blue.h"
#include "blue_aliases.h"
#include "pwm.h"
#include "Clock_1.h"
#include "spi.h"
#include "spi_PVT.h"
#include "Pin_SS.h"
#include "Pin_SS_aliases.h"
#include "Pin_SCLK.h"
#include "Pin_SCLK_aliases.h"
#include "Pin_MOSI.h"
#include "Pin_MOSI_aliases.h"
#include "Pin_MISO.h"
#include "Pin_MISO_aliases.h"
#include "Clock_2.h"
#include "PIN_ADS1299_RESET.h"
#include "PIN_ADS1299_RESET_aliases.h"
#include "PIN_ADS1299_START.h"
#include "PIN_ADS1299_START_aliases.h"
#include "PIN_ADS1299_PWDN.h"
#include "PIN_ADS1299_PWDN_aliases.h"
#include "PIN_ADS1299_DRDY.h"
#include "PIN_ADS1299_DRDY_aliases.h"
#include "PIN_ADS1299_GPIO_1.h"
#include "PIN_ADS1299_GPIO_1_aliases.h"
#include "PIN_ADS1299_GPIO_2.h"
#include "PIN_ADS1299_GPIO_2_aliases.h"
#include "PIN_ADS1299_GPIO_3.h"
#include "PIN_ADS1299_GPIO_3_aliases.h"
#include "PIN_ADS1299_GPIO_4.h"
#include "PIN_ADS1299_GPIO_4_aliases.h"
#include "capsense.h"
#include "capsense_CSHL.h"
#include "capsense_TunerHelper.h"
#include "capsense_SMS.h"
#include "capsense_PVT.h"
#include "capsense_IP.h"
#include "ble_bless_isr.h"
#include "capsense_SampleClk.h"
#include "capsense_Sns_aliases.h"
#include "capsense_SenseClk.h"
#include "cy_em_eeprom.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"

/*[]*/

